app/Http/Controllers/ListingController.php

    public function index(): Factory|View|Application
    {
        return view('listings.index', [
            'listings' => Listing::latest()
                ->filter(request(['tag', 'search']))
                ->paginate(6) // paginate will give you number for the pagination, we can also use simplePaginate()
        ]);
---
SELECT * FROM `listings` WHERE `tags` like '%laravel%' ORDER BY `created_at` DESC LIMIT 6 offset 0
SELECT count(*) as aggregate FROM `listings` WHERE `tags` like '%laravel%'

    public function store(Request $request): Redirector|Application|RedirectResponse
    {
        $formFields = $request->validate([
            'title' => 'required',
            'company' => [
                'required',
                Rule::unique('listings', 'company')
            ],
            'location' => 'required',
            'website' => 'required',
            'email' => ['required', 'email'],
            'tags' => 'required',
            'description' => 'required'
        ]);

        if($request->hasFile('logo')) {
            $formFields['logo'] = $request->file('logo')->store('logos', 'public');
        }
        $formFields['user_id'] = auth()->id();

        Listing::create($formFields);
---
INSERT INTO `listings` (`title`, `company`, `location`, `website`, `email`, `tags`, `description`, `logo`, `user_id`, `updated_at`, `created_at`) VALUES ('Scenior PHP Dev', 'Skynet', 'London', 'www.test.co.uk', 'test@test.com', 'Laravel, Vue, mySQL', 'kjasdkjakjkjsad', 'logos/mJ7HjpL1RtpmiCqyOMKW7Jo0o8K5xVm2UFfYB6qQ.png', 2, '2022-08-26 15:54:14', '2022-08-26 15:54:14')

    public function manage(){
        return view('listings.manage', ['listings' => auth()->user()->listing()->get()]);
---
SELECT * FROM `listings` WHERE `listings`.`user_id` = 2 and `listings`.`user_id` IS not NULL