app/Http/Controllers/UserController.php

    public function store(Request $request): Redirector|Application|RedirectResponse
    {
        $formFields = $request->validate(
            [
                'name'     => ['required', 'min:3'],
                'email'    => ['required', 'email', Rule::unique('users','email')],
                'password' => 'required|confirmed|min:6',
            ]
        );

        // hash password
        $formFields['password'] = bcrypt($formFields['password']);

        // create user
        $user = User::create($formFields);
---
INSERT INTO `users` (`name`, `email`, `password`, `updated_at`, `created_at`) VALUES ('alex', 'alex@gmail.com', '$2y$10$rgXCTekMYLPeKrZD70omoe/hoBVcY9n/VKTQ8Dgg6meC3ogeAFBhG', '2022-08-26 15:49:59', '2022-08-26 15:49:59')